app/controllers/short_urls_controller.rb

  def show
    @short_url = ShortUrl.find(params[:full_url])
---
SELECT `short_urls`.* FROM `short_urls` WHERE `short_urls`.`id` = NULL LIMIT 1